{
  "pageTitle": "IONIC FRAMEWORK - Aplikace",
  "langugePicker": "Jazyk:",
  "pageExplain": "Přehled funkcí a použitých API v rámci jednotlivých záložek/stránek.",
  "pageDescription": "Popis stránky",
  "pageFeatures": "Funkce stránky",
  "pageAPI": "API",
  
  "pageInfoDescription": "Stránka je určená pro zobrazení a vysvětlení všech záložek/stránek v rámci tohoto projektu. U každé stránky si lze přečíct základní popis k čemu je určená, co stránka nabízí případně jaké API využívá.",
  "pageInfoFeaturesPart1": "Stránka umožňuje přeložení celé stránky pomocí přepínače v horní části stránky. Tato funkce funguje za pomocí frameworku i18next více na stránce: ",
  "pageInfoFeaturesPart2": " Ve zkratce to znamená, že každý jazyk má definovaný svůj translation.json soubor, který obsahuje seznam všech překladů, které se následně zobrazují na stránce podle zvoleného jazyka.",
  "pageInfoAPI": "Tato stránka nevyužívá žádné API.",
  
  "pageSSearchDescription": "Stránka pro vyhledávání společností a zobrazení jejich základních informací a vývoje ceny akcie.",
  "pageSSearchFeatures": "Stránka umožňuje vyhledání konkrétně společnosti, které je obchodovatelná na burze. U vyhledané společnosti se zobrazují základní informace (název, burza, odvětví, popis, počet zaměstnanců). U popisu společnosti je možné provést překlad textu přes API. Dále stránka nabízí náhled na graf s vývojem ceny akcie za určité období, které si lze zvolit pomocí přepínače od 1 dne až po celou dobu co je společnost na burze. Pod grafem je přehled minimální/maximální a první/poslední hodnoty z grafu za konkrétní období + návratnost za dané období (rozdíl první a poslední hodnoty).",
  "pageSSearchAPICall1": "API příkaz: https://cloud.iexapis.com/stable/stock/{tickerSymbol}/company?token={API_TOKEN}",
  "pageSSearchAPICall1Description": "Tento příkaz slouží k získání základních informací o společnosti. Ze získaného JSONu se použijí tyto informace: název společnosti, burza, odvětví, popis a počet zaměstnanců (ty se následně zobrazují na stránce)",
  "pageSSearchAPICall2": "API příkaz: https://cloud.iexapis.com/stable/stock/{tickerSymbol}/chart/1d?token=${API_TOKEN}",
  "pageSSearchAPICall2Description": "Tento příkaz slouží pro získání dat o ceně akcie za poslední obchodovatelný den. Získaná data se zobrazují v grafu (cena, čas).",
  "pageSSearchAPICall3": "API příkaz: https://cloud.iexapis.com/stable/stock/{tickerSymbol}/chart/{selectedTimeFrame}?token={API_TOKEN}",
  "pageSSearchAPICall3Description": "Tento příkaz slouží pro získání dat o ceně akcie za určité období. Získaná data se zobrazují v grafu (cena, datum). Z důvodu toho, že struktura JSONu je pro období delší než 1 den jiná je potřeba použít tento API příkaz místo předchozího.",
  "pageSSearchAPICall4": "API příkaz: https://microsoft-translator-text.p.rapidapi.com/translate?to%5B0%5D=cs&api-version=3.0&profanityAction=NoAction&textType=plain",
  "pageSSearchAPICall4Description": "Tento příkaz slouží pro překlad textu z angličtiny do češtiny. V rámci aplikace se používá pro překlad popisu společnosti.",

  "pageWatchlistDescription": "Stránka určená pro vytváření a správu watchlistu pro jednotlivé společnosti (akcie).",
  "pageWatchlistFeatures": "Stránka umožňuje zobrazení a správu seznamu společností, které si uživatel přidal do své watchlistu. U každé společnosti se zobrazují základní informace (ticker, cena, vývoj ceny, nejnižší a nejvyšší cena za poslední 1 rok (52 týdnů). U každé akcie je možnost si zobrazit její nejnovější zprávy (více v sekci 'News'). Dále v rámci watchlistu je možné změnit pořadí jednotlivých společností, případně je z watchlistu odstranit. Dále zde probíhá kontrola každých 5 minut, zda se cena akcie nezměnila. Pokud ano, tak se zobrazí upozornění, že se cena změnila zda uživatel chce aktualizovat ceny",
  "pageWatchlistAPICall1": "API příkaz: https://cloud.iexapis.com/stable/stock/${tickerSymbol}/price?token=${API_TOKEN}",
  "pageWatchlistAPICall1Description": "Tento příkaz slouží pro získání aktuální ceny akcie. V rámci watchlistu je primárně použitý pro sledování změny první akcie z watchlistu. V případě, že se cena změní tak se zobrazí tlačítko s možností aktualizace cen akcií v celém watchlistu.",
  "pageWatchlistAPICall2": "API příkaz: https://cloud.iexapis.com/stable/stock/${tickerSymbol}/quote?token=${API_TOKEN}",
  "pageWatchlistAPICall2Description": "Tento příkaz slouží pro získání informací u jednotlivých akcií pro jejich následné zobrazení ve watchlistu (cena, vývoj ceny, nejnižší a nejvyšší cena za poslední 1 rok (52 týdnů).",

  "pageNewsDescription": "Podstránka ve watchlistu pro zobrazení seznamu zpráv pro konkrétní společnost.",
  "pageNewsFeatures": "Stránka zobrazuje deset nejnovějších zpráv týkajících se konkrétní společnosti. Zprávy jsou řazeny od nejnovější. Každá zpráva obsahuje název, obrázek, datum, zdroj, popis a odkaz na celý článek.",
  "pageNewsAPICall": "API příkaz: https://cloud.iexapis.com/stable/tock/${ticker}/news/last/10?token=${API_TOKEN}",
  "pageNewsAPICallDescription": "Tento příkaz slouží pro seznamu deseti nejnovějších zpráv pro konkrétní společnost. Získaná data se zobrazují na stránce (název, obrázek, datum, zdroj, popis a odkaz na celý článek).",

  "pageIPOsDescription": "Stránka pro zobrazení seznamu společností, které se chystají na IPO (Initial Public Offering = vstup společnosti na burzu, kde nabízí své akcie veřejnosti).",
  "pageIPOsFeatures": "Stránka zobrazuje seznam společností, které v nejbližších dnech budou vstupovat na burzu. Seznam je rozdělený na jednotlivé dny, které jsou seřazeny tak, aby se zobrazoval vždy nejnovější nahoře. U každého záznamu (společnosti) v seznamu se zobrazuje její název, ticker, rozptyl ceny a počet akcií.",
  "pageIPOsAPICall": "API příkaz: https://cloud.iexapis.com/stable/stock/upcoming-ipos?token=${API_TOKEN}",
  "pageIPOsAPICallDescription": "Tento příkaz slouží pro získání seznamu všech akcií, které mají naplánované IPO. Ze získaných dat následně používáme datum, tiker, cenový rozptyl, počet akcií a název společnosti.",

  "pageEarningsDescription": "Stránka pro zobrazení seznamu společností, které budou v nejbližších dnech zveřejňovat své výsledky za dané čtvrtletí.",
  "pageEarningsFeatures": "Stránka podobně jako IPOs zobrazuje seznam společností, které v nejbližších dnech budou zveřejňovat výsledky. Seznam je rozdělený na jednotlivé dny, které jsou seřazeny tak, aby se zobrazoval vždy nejnovější nahoře. U každého záznamu (společnosti) v seznamu se zobrazuje pouze její ticker",
  "pageEarningsAPICall": "API příkaz: https://cloud.iexapis.com/stable/stock/market/upcoming-earnings?token=${API_TOKEN}",
  "pageEarningsAPICallDescription": "Tento příkaz slouží pro získání seznamu všech akcií, které mají naplánované zveřejnění výsledků. Z daného příkazu použijeme všechny data (datum, ticker)"
}